import { Pipe, PipeTransform } from '@angular/core';

@Pipe({
  name: 'enum',
  standalone: true
})
export class EnumPipe implements PipeTransform {

  enumDisplayMap: { [key: string]: { [key: number]: string } } = {
    tripTicketType: {
      1: "رحلة مفتوحة ذهاب فقط",
      2: "رحلة مفتوحة عودة فقط",
      3: "رحلة مفتوحة ذهاب وعودة",
      4: "تسكين",
      5: "رحلة ذهاب وعودة",
      6: "رحلة مفتوحة مكة مدينة"
    },
    PaymentType: {
      1: "مدفوع",
      2: "غير مدفوع",
      3: "مدفوع جزئيًا"
    },
    stayType: {
      1: "عزاب",
      2: "عائلي"
    },
    room_types: {
      1: "غرفة س كينج",
      2: "غرفة ثنائي",
      3: "غرفة ثلاثي",
      4: "غرفة رباعي",
      5: "غرفة خماسي",
      6: "غرفة سداسي",
      7: "غرفة سباعي",
      8: "غرفة ثماني",
    },
    room_types_short: {
      1: "فردي",
      2: "ثنائي",
      3: "ثلاثي",
      4: "رباعي",
      5: "خماسي",
      6: "سداسي",
      7: "سباعي",
      8: "ثماني",
    },
    nationality: {
      0: "مصري",
      1: "سعودي",
      2: "إماراتي",
      3: "قطري",
      4: "كويتي",
      5: "بحريني",
      6: "عماني",
      7: "أردني",
      8: "لبناني",
      9: "سوري",
      10: "فلسطيني",
      11: "عراقي",
      12: "ليبي",
      13: "تونسي",
      14: "جزائري",
      15: "مغربي",
      16: "سوداني",
      17: "موريتاني",
      18: "يمني",
      19: "هندي",
      20: "باكستاني",
      21: "اندونيسي",
      22: "بنجلادش",
      23: "صومالي",
      24: "تشادي",
      25: "نيجيري",
      26: "إيطالي",
      27: "امريكي",
      28: "تركي",
      29: "فلبيني",
    },
    gender: {
      1: "ذكر",
      2: "أنثى"
    },
    city: {
      1: "الدمام",
      2: "مكة المكرمة",
      3: "المدينة المنورة",
      4: "القصيم",
      5: "الشرقية",
      6: "عسير",
      7: "تبوك",
      8: "حائل",
      9: "الحدود الشمالية",
      10: "جازان",
      11: "نجران",
      12: "الباحة",
      13: "الجوف"
    },
    double_city: {
      1: "الدمام - مكة",
      2: "مكة المكرمة - مدينة",
      3: "المدينة المنورة - الدمام",

    },
    busType: {
      1: "Standard-47",
      2: "Standard-49",
      3: "Standard-51",
      4: "VIP-28",
      5: "VIP-28Left",
      6: "VIP-29Left",
      7: "VIP-30",
      8: "Standard-49 (2)",
    },

    PaymentMethod: {
      0: "غير معروف",
      1: "كاش",
      2: "تحويل",
      3: "شبكة",
      4: "خصم"
    }

  };


  transform(value: number, enumType: string): string {
    const map = this.enumDisplayMap[enumType];
    return map ? (map[value] ?? 'غير معروف') : 'نوع غير معروف';
  }


}

